examples/ahmedBody/simpleFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0.05;
        smoother        symGaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 5;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        tolerance       1e-12;
        relTol          0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-10;
        relTol          0.01;
    }
    "(U|k|epsilon|omega|R|nuTilda)Final"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-12;
        relTol          0;
    }
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    5;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    
    //~ consistent         yes;
    consistent         no;
    
	outerCorrectorResidualControl
	{
		U
		{
			tolerance	1e-5;
			relTol		0;
		}
		p
		{
			tolerance	5e-4;
			relTol		0;
		}
	}
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;
    consistent yes;
    
    residualControl
    {
        p           1e-5;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p           0.05;
        U           0.2;
        k           0.2;
        omega       0.2;
    }

    equations
    {
        ".*" 0.5;
    }
}

cache
{
    grad(U);
}
// ************************************************************************* //
